---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Dispose
source: html/4a0585f5-a9dd-da42-3925-bfbb92a35cf9.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Dispose Method

Releases all resources used by the AnalysisResultSchema

## Syntax (C#)
```csharp
public void Dispose()
```